reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
// ===========================================================================
//  Athena Rover 2026 — Firmware ESP32-S3
//  Retos del Rover H07 · INTEC · Reymildo & Montse
// ===========================================================================
//
//  TODO el firmware vive en este archivo, a propósito. Cada subsistema del
//  robot corre en su propia tarea de FreeRTOS, independiente de las demás,
//  comunicadas SOLO por colas explícitas. Un fallo en una tarea no bloquea
//  ni tumba a las otras.
//
//  Dependencias externas: NINGUNA. Solo el framework Arduino-ESP32 (que ya
//  trae FreeRTOS) y su librería Wire. Los drivers del PCA9685 y del TCS34725
//  están escritos aquí mismo: son un puñado de registros I2C cada uno, y
//  escribirlos nos da control total sobre tiempos y ganancia.
//
//  HARDWARE
//    · 2x L298N            -> 4 motores (cada driver mueve 2)
//    · 1x PCA9685 (I2C)    -> 1 servo del gripper (la pinza que abre/cierra)
//    · 2x TCS34725 (I2C)   -> sensor de color delantero y trasero
//    · 1x VL53L1X (I2C)    -> telémetro delante del gripper, distancia a la bandera
//    · 2x QTRX-HD-01A      -> reflectancia delantera izquierda y derecha
//    · LED RGB (1x)        -> identificación de equipo (lo exige el reglamento);
//                             antes eran 2 LED discretos rojo/azul, ya no existen
//    · Switch de 3 posiciones (ON-OFF-ON) -> quién es "nuestro equipo":
//                             0=nadie ha elegido, 1=azul, 2=rojo (ver TeamSwitch)
//    · Enlace con la Raspberry Pi por USB (CDC nativo)
//
//  ÍNDICE
//    [1] Configuración: pines, prioridades, stacks, periodos
//    [2] Tipos compartidos entre tareas
//    [3] Protocolo serial con la Raspberry Pi (formato de cable exacto)
//    [4] Colas
//    [5] Watchdog cooperativo (heartbeats)
//    [6] Driver PCA9685 (servos por I2C)
//    [7] Driver TCS34725 (sensores de color por I2C)
//    [8] Tareas
//    [9] setup() / loop()
//
// ===========================================================================

#include <Arduino.h>
#include <Wire.h>
#include <VL53L1X.h>
#include <freertos/semphr.h>   // SemaphoreHandle_t / mutex del bus I2C nº0 (ver g_i2c0Mutex)
#include <esp_system.h>        // esp_reset_reason() — ver el log de arranque en setup()

// ===========================================================================
//  [1] CONFIGURACIÓN
// ===========================================================================
//
//  PINES PROHIBIDOS en el ESP32-S3 DevKitC-1 — respetarlos no es opcional:
//    GPIO 19, 20    -> USB nativo (D-/D+). Es por donde habla la Raspberry Pi.
//    GPIO 43, 44    -> U0TXD/U0RXD, puerto de programación y depuración.
//    GPIO 26..32    -> flash SPI interna. Tocarlos cuelga el chip.
//    GPIO 33..37    -> PSRAM Octal (módulos N8R8/N16R8). Igual de intocables.
//    GPIO 0, 45, 46 -> pines de strapping: su nivel al arranque decide el modo
//                      de boot. Si algo los tira a un nivel raro, el ESP32 no
//                      arranca. Evitarlos.
//    GPIO 3         -> strapping de JTAG. Se puede usar, pero mejor no.
//
//  Además: los sensores analógicos DEBEN ir en ADC1 (GPIO 1..10). El ADC2
//  queda inutilizable en cuanto se enciende el WiFi.

namespace Pins {
    // -------- Motores: 2x L298N, cada uno mueve 2 motores ------------------
    // Driver IZQUIERDO -> motor delantero izq. (FL) y trasero izq. (RL)
    constexpr uint8_t L298N_L_IN1 = 4;    // FL sentido A
    constexpr uint8_t L298N_L_IN2 = 5;    // FL sentido B
    constexpr uint8_t L298N_L_ENA = 6;    // FL velocidad (PWM)
    constexpr uint8_t L298N_L_IN3 = 7;    // RL sentido A
    constexpr uint8_t L298N_L_IN4 = 15;   // RL sentido B
    constexpr uint8_t L298N_L_ENB = 16;   // RL velocidad (PWM)

    // Driver DERECHO -> motor delantero der. (FR) y trasero der. (RR)
    constexpr uint8_t L298N_R_IN1 = 10;   // FR sentido A
    constexpr uint8_t L298N_R_IN2 = 11;   // FR sentido B
    constexpr uint8_t L298N_R_ENA = 12;   // FR velocidad (PWM)
    constexpr uint8_t L298N_R_IN3 = 13;   // RR sentido A
    constexpr uint8_t L298N_R_IN4 = 14;   // RR sentido B
    constexpr uint8_t L298N_R_ENB = 17;   // RR velocidad (PWM)

    // -------- Bus I2C nº0: PCA9685 (servos) + TCS34725 DELANTERO -----------
    constexpr uint8_t I2C0_SDA = 8;
    constexpr uint8_t I2C0_SCL = 9;

    // -------- Bus I2C nº1: TCS34725 TRASERO --------------------------------
    // Los dos TCS34725 tienen la MISMA dirección fija (0x29) y no se puede
    // cambiar. Por eso van en buses separados: el ESP32-S3 tiene dos
    // controladores I2C, así nos ahorramos el multiplexor TCA9548A.
    constexpr uint8_t I2C1_SDA = 47;
    constexpr uint8_t I2C1_SCL = 48;

    // -------- LED de iluminación de cada TCS34725 ---------------------------
    // Pin "LED" de la placa del sensor: enciende sus 2 LED blancos para no
    // depender de la luz ambiente del salón al clasificar el color del piso.
    // Solo el DELANTERO se controla por GPIO. El TRASERO se cableó directo a
    // 3.3V (ver hardware/conexiones-esp32-s3.md): en la práctica nunca se
    // apagaba por software (ver el commit que liberó Pins::TEAM_SWITCH_BLUE),
    // así que cablearlo fijo da el mismo comportamiento y libera ese GPIO
    // para el switch de equipo.
    constexpr uint8_t TCS_LED_FRONT = 18;

    // -------- Switch de 3 posiciones (ON-OFF-ON): selección de equipo -------
    // El común del switch va a GND; cada tiro cierra a GND uno de estos 2
    // GPIO. Se leen con pull-up interno (INPUT_PULLUP): HIGH = tiro abierto,
    // LOW = tiro cerrado. En la posición central (0, idle) NINGÚN tiro está
    // cerrado, así que los 2 GPIO leen HIGH — ver el namespace TeamSwitch.
    //
    // GPIO 21 se liberó del LED de iluminación del TCS34725 trasero (ver
    // arriba). GPIO 40 ya se usaba con el mismo propósito, pero como un solo
    // puente a GND de 2 estados, en firmware-esp32-standalone/ (Pins::
    // TEAM_SELECT) — aquí se suma el segundo tiro para tener una posición de
    // reposo real (0 = nadie ha elegido equipo todavía) en vez de arrancar
    // siempre decidido a AZUL u ROJO.
    constexpr uint8_t TEAM_SWITCH_BLUE = 21;  // tiro "AZUL": cerrado a GND = equipo azul
    constexpr uint8_t TEAM_SWITCH_RED  = 40;  // tiro "ROJO": cerrado a GND = equipo rojo

    // -------- VL53L1X (ToF), delante del gripper ---------------------------
    // Va en el bus I2C nº0 (mismo que el PCA9685 y el TCS34725 delantero). El
    // PCA9685 no da problema (dirección fija 0x40, distinta), pero el
    // TCS34725 delantero SÍ: arranca en la MISMA dirección fija 0x29 que el
    // VL53L1X, así que este pin XSHUT es necesario para quedarse en reset
    // (sin responder en el bus) hasta que se le reasigna una dirección nueva
    // — ver TofSensorTask y la nota en I2CAddr::VL53L1X_BOOT_ADDR más abajo
    // para el riesgo que esto implica.
    //
    // GPIO 3 a propósito: es el único pin libre físicamente junto al bus I2C0
    // (queda justo debajo de GPIO8 en el header J1 del DevKitC-1), así que el
    // cable de XSHUT queda corto, junto a SDA/SCL. Es strapping de JTAG —
    // "se puede usar, pero mejor no" (ver la tabla de pines prohibidos) — pero
    // solo importa su nivel durante el arranque/reset, ANTES de que setup()
    // corra una sola línea; nuestro digitalWrite() llega después y no cambia
    // esa decisión. Lo único a vigilar es que algunas placas del VL53L1X
    // traen su propio pull-up en XSHUT (ver TofSensorTask): si ese pull-up
    // tira el pin a un nivel que habilita/deshabilita JTAG de forma distinta
    // a la que quieres, no rompe el arranque (JTAG no es boot mode), pero
    // puede sorprender si esperabas depurar por JTAG y no responde.
    constexpr uint8_t TOF_XSHUT = 3;

    // -------- Reflectancia QTRX-HD-01A (salida analógica) ------------------
    // ¡ALIMENTARLOS A 3.3 V! La salida del QTRX es proporcional a su VIN: a
    // 5 V entregaría hasta 5 V y eso quema la entrada ADC del ESP32-S3.
    constexpr uint8_t QTR_LEFT_OUT  = 1;  // GPIO1 = ADC1_CH0
    constexpr uint8_t QTR_RIGHT_OUT = 2;  // GPIO2 = ADC1_CH1
    // Pin CTRL de los emisores IR, compartido por ambos sensores. Permite
    // apagar los LED infrarrojos para medir la luz ambiente y restarla.
    constexpr uint8_t QTR_EMITTER_CTRL = 42;

    // -------- LED RGB indicador de equipo -----------------------------------
    // Reemplaza a los 2 LED discretos rojo/azul que documentaba antes esta
    // sección (GPIO 40/41): el equipo ya no los tiene montados, solo queda
    // este único LED RGB. El canal B vivía en GPIO 3 (strapping de JTAG);
    // se corrió a GPIO 41 para cederle el 3 al XSHUT del VL53L1X (ver
    // Pins::TOF_XSHUT), que sí se beneficia de estar junto al I2C0.
    constexpr uint8_t LED_RGB_R = 39;
    constexpr uint8_t LED_RGB_G = 38;
    constexpr uint8_t LED_RGB_B = 41;
}

