reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
namespace I2CAddr {
    constexpr uint8_t PCA9685  = 0x40;   // dirección por defecto (A0..A5 sin puentear)
    constexpr uint8_t TCS34725 = 0x29;   // fija, no se puede cambiar

    // El VL53L1X arranca SIEMPRE en 0x29 — la misma dirección fija del
    // TCS34725, y comparten el bus I2C nº0 (ver Pins::TOF_XSHUT). El PCA9685,
    // que también vive en ese bus, no es un problema (0x40, distinta). Por
    // eso se le reasigna esta dirección nueva al VL53L1X en cuanto sale de
    // reset, antes de hacer cualquier otra cosa con él.
    //
    // ⚠️ ESA REASIGNACIÓN ES UNA ÚNICA ESCRITURA CORTA hecha mientras el
    // VL53L1X TODAVÍA responde en 0x29 — el mismo instante en que el
    // TCS34725 delantero, que no tiene forma de silenciarse, también sigue
    // vivo en esa dirección en el mismo bus. No hay manera de evitarlo con
    // el hardware actual (el TCS34725 no tiene pin de reset/shutdown). El
    // riesgo se mantiene acotado a propósito: es SOLO esa escritura de 3
    // bytes, no la inicialización completa del sensor (que si ocurriera con
    // los dos chips en la misma dirección sí sería un problema serio). Si el
    // TCS34725 delantero empieza a comportarse raro después de un reset, este
    // es el primer sospechoso — revisar con el analizador lógico.
    constexpr uint8_t VL53L1X_BOOT_ADDR = 0x29;
    constexpr uint8_t VL53L1X = 0x30;
}

// Canal del PCA9685 usado por el gripper. El robot tiene UN SOLO servo:
// abre y cierra la pinza, nada más. No hay servo de elevación.
namespace ServoChannel {
    constexpr uint8_t CLAW = 0;   // abre/cierra la pinza
}

namespace Pwm {
    // Motores. El L298N es un driver bipolar antiguo y no conmuta bien a
    // frecuencias altas: 20 kHz lo hace calentar y perder par. 1 kHz es el
    // punto sano, aunque queda dentro del rango audible (se oirá un zumbido).
    constexpr uint32_t MOTOR_FREQ_HZ    = 1000;
    constexpr uint8_t  MOTOR_RESOLUTION = 8;     // duty 0..255

    // LED RGB. Fuera del rango audible y sin parpadeo visible a simple vista.
    constexpr uint32_t RGB_FREQ_HZ    = 5000;
    constexpr uint8_t  RGB_RESOLUTION = 8;       // duty 0..255

    // Servos por PCA9685: 50 Hz, 12 bits de resolución (0..4095 por periodo).
    // Un periodo de 20 ms en 4096 pasos -> 1.0 ms = 205 y 2.0 ms = 410.
    constexpr uint32_t SERVO_FREQ_HZ  = 50;
    constexpr uint16_t SERVO_TICK_MIN = 205;   // pulso 1.0 ms ->   0 grados
    constexpr uint16_t SERVO_TICK_MAX = 410;   // pulso 2.0 ms -> 180 grados
}

// Prioridades FreeRTOS (mayor número = mayor prioridad). La loopTask de
// Arduino corre en prioridad 1, así que todo lo que deba ganarle va encima.
namespace TaskPriority {
    constexpr UBaseType_t SUPERVISOR      = 6;  // debe seguir vivo pase lo que pase
    constexpr UBaseType_t MOTOR_CONTROL   = 5;  // crítico: parada de emergencia
    constexpr UBaseType_t SERIAL_COMM     = 4;  // el enlace no debe acumular retraso
    constexpr UBaseType_t GRIPPER_CONTROL = 3;
    constexpr UBaseType_t REFLECTANCE     = 3;  // realimentación rápida de línea
    constexpr UBaseType_t COLOR_SENSOR    = 2;
    constexpr UBaseType_t TOF_SENSOR      = 2;  // mismo nivel que los demás sensores
    constexpr UBaseType_t LED_STATUS      = 1;
}

// OJO: en ESP-IDF (y por tanto en Arduino-ESP32) el parámetro de stack de
// xTaskCreate va en BYTES, no en palabras como en el FreeRTOS de referencia.
// Valores de partida conservadores: medirlos con uxTaskGetStackHighWaterMark()
// en las pruebas de banco y recortarlos ahí.
namespace TaskStack {
    constexpr uint32_t SUPERVISOR      = 3072;
    constexpr uint32_t SERIAL_COMM     = 4096;
    constexpr uint32_t MOTOR_CONTROL   = 3072;
    constexpr uint32_t GRIPPER_CONTROL = 3072;
    constexpr uint32_t REFLECTANCE     = 2560;
    constexpr uint32_t COLOR_SENSOR    = 3584;
    // La librería de Pololu es más pesada que nuestros drivers a mano
    // (PCA9685/TCS34725): le damos más margen que a COLOR_SENSOR.
    constexpr uint32_t TOF_SENSOR      = 4096;
    constexpr uint32_t LED_STATUS      = 2048;
}

namespace TaskPeriodMs {
    constexpr uint32_t SUPERVISOR    = 200;
    constexpr uint32_t SERIAL_COMM   = 5;    // 200 Hz
    constexpr uint32_t MOTOR_CONTROL = 20;   // 50 Hz
    constexpr uint32_t GRIPPER       = 50;
    constexpr uint32_t REFLECTANCE   = 20;   // 50 Hz, seguimiento de línea
    constexpr uint32_t COLOR_SENSOR  = 100;  // 10 Hz, de sobra para las zonas
    constexpr uint32_t TOF_SENSOR    = 50;   // 20 Hz, igual al periodo de rango configurado
    constexpr uint32_t LED_STATUS    = 250;
}

constexpr uint32_t SERIAL_BAUD_RATE = 115200;

// Sin heartbeat por más de este tiempo, el supervisor da la tarea por colgada.
constexpr uint32_t WATCHDOG_TIMEOUT_MS = 1000;

// Si MotorTask pasa este tiempo sin un comando válido, frena por su cuenta.
constexpr uint32_t COMMS_FAILSAFE_TIMEOUT_MS = 500;

// Identificadores de tarea, usados como índice del arreglo de heartbeats.
// SUPERVISOR no está aquí a propósito: es quien vigila y no se vigila a sí
// mismo (de eso se encarga el Task Watchdog Timer del propio ESP-IDF).
enum class TaskId : uint8_t {
    SERIAL_COMM = 0,
    MOTOR_CONTROL,
    GRIPPER_CONTROL,
    COLOR_SENSOR,
    REFLECTANCE,
    LED_STATUS,
    TOF_SENSOR,   // agregado al final a propósito: no mueve el bit de nadie más
    COUNT   // siempre el último
};

// ---------------------------------------------------------------------------
//  Enlace con la Raspberry Pi.
//
//  Se usa el puerto USB NATIVO del ESP32-S3 (los GPIO 19/20), que aparece en
//  la Raspberry Pi como /dev/ttyACM0. Ventaja frente a usar el puerto UART:
//  deja libre el puerto de programación para depurar con un segundo cable
//  mientras el robot conversa con la Pi.
//
//  Requiere estos build_flags en platformio.ini (ya están puestos):
//      -D ARDUINO_USB_CDC_ON_BOOT=1
//      -D ARDUINO_USB_MODE=1
//
//  Con esos flags, `Serial` es el USB nativo y `Serial0` es el UART0 del
//  puerto de programación.
// ---------------------------------------------------------------------------
#define RPI_LINK   Serial     // datos hacia/desde la Raspberry Pi
#define DEBUG_LINK Serial0    // consola de depuración (puerto UART del DevKit)

