reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    // Canales parejos = superficie gris: el tapete de la pista.
    return ColorLabel::FLOOR;
}

// ===========================================================================
//  [8] TAREAS
// ===========================================================================

namespace {

// ---------------------------------------------------------------------------
//  8.1  MotorTask — 4 motores a través de 2 drivers L298N
// ---------------------------------------------------------------------------
//  Es la tarea más crítica para la seguridad: si el enlace con la Raspberry Pi
//  se cae, ésta frena por su cuenta sin esperar a que nadie se lo ordene.
//
//  RECORDATORIO DE MONTAJE: hay que QUITAR los jumpers de ENA y ENB en ambos
//  L298N. Si se dejan puestos, el enable queda fijo a 5 V y el PWM no hace
//  absolutamente nada: los motores girarán siempre a full o nada.

struct Motor {
    uint8_t in1, in2, en, ledc_channel;
};

// kMotorFL: con el cableado físico actual, la rueda conectada a OUT1/OUT2
// del L298N izquierdo (la trasera izquierda del chasis) gira al revés
// respecto a las otras tres. En vez de ramificar MotorApply() con un flag de
// inversión, se intercambia el ORDEN de los dos GPIO aquí mismo: Pins::
// L298N_L_IN1 y L298N_L_IN2 siguen siendo, físicamente, los pines soldados a
// los terminales IN1 e IN2 del L298N (ver hardware/conexiones-esp32-s3.md) —
// lo único que cambia es cuál de los dos hace de "in1" y cuál de "in2" para
// ESTE motor, así que MotorApply() queda idéntica para los 4 motores. Si se
// recablea este motor para que coincida con los otros tres, basta con
// volver a poner IN1, IN2 en orden aquí.
constexpr Motor kMotorFL = {Pins::L298N_L_IN2, Pins::L298N_L_IN1, Pins::L298N_L_ENA, 0};
constexpr Motor kMotorRL = {Pins::L298N_L_IN3, Pins::L298N_L_IN4, Pins::L298N_L_ENB, 1};
constexpr Motor kMotorFR = {Pins::L298N_R_IN1, Pins::L298N_R_IN2, Pins::L298N_R_ENA, 2};
constexpr Motor kMotorRR = {Pins::L298N_R_IN3, Pins::L298N_R_IN4, Pins::L298N_R_ENB, 3};

// La API de LEDC cambió entre el core 2.x y el 3.x de Arduino-ESP32. Estas
// dos funciones absorben la diferencia para que el firmware compile en ambos.
// Reciben freq/resolución como parámetro porque no todos los canales PWM del
// robot usan los mismos: los motores van a 1 kHz/8 bits, el LED RGB a 5 kHz.
void PwmAttach(uint8_t pin, uint8_t channel, uint32_t freqHz, uint8_t resolution) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    (void)channel;                       // en 3.x el canal se asigna solo
    ledcAttach(pin, freqHz, resolution);
#else
    ledcSetup(channel, freqHz, resolution);
    ledcAttachPin(pin, channel);
#endif
}

void PwmWrite(uint8_t pin, uint8_t channel, uint32_t duty) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    (void)channel;
    ledcWrite(pin, duty);
#else
    (void)pin;
    ledcWrite(channel, duty);
#endif
}

void MotorSetup(const Motor &m) {
    pinMode(m.in1, OUTPUT);
    pinMode(m.in2, OUTPUT);
    PwmAttach(m.en, m.ledc_channel, Pwm::MOTOR_FREQ_HZ, Pwm::MOTOR_RESOLUTION);
    PwmWrite(m.en, m.ledc_channel, 0);
}

// speed: -100..100. El signo define el sentido, la magnitud el duty.
void MotorApply(const Motor &m, int speed) {
    speed = constrain(speed, -100, 100);
    const bool forward = (speed >= 0);
    digitalWrite(m.in1, forward ? HIGH : LOW);
    digitalWrite(m.in2, forward ? LOW  : HIGH);
    PwmWrite(m.en, m.ledc_channel, (uint32_t)abs(speed) * 255u / 100u);
}

void MotorsStop() {
    MotorApply(kMotorFL, 0);
    MotorApply(kMotorRL, 0);
    MotorApply(kMotorFR, 0);
    MotorApply(kMotorRR, 0);
}

void MotorTask(void *) {
    MotorSetup(kMotorFL);
    MotorSetup(kMotorRL);
    MotorSetup(kMotorFR);
    MotorSetup(kMotorRR);
    MotorsStop();

    MotorCommand current{};                  // por defecto: STOP
    uint32_t last_cmd_ms = millis();

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::MOTOR_CONTROL);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        MotorCommand incoming;
        if (xQueueReceive(g_motorCmdQueue, &incoming, 0) == pdTRUE) {
            current = incoming;
            last_cmd_ms = millis();
        }

        // Failsafe propio: no depende de que otra tarea lo detecte por nosotros.
        const bool comms_stale =
            (uint32_t)(millis() - last_cmd_ms) > COMMS_FAILSAFE_TIMEOUT_MS;
        // Segundo failsafe, independiente del primero: mientras el switch
        // físico de equipo siga en la posición central (nadie lo ha movido
        // todavía), el robot se queda quieto pase lo que mande la Raspberry
        // Pi. Ver g_switchTeam.
        const bool team_undecided = (g_switchTeam == TeamColor::NONE);

        if (comms_stale || team_undecided || current.mode == MotorMode::STOP) {
            MotorsStop();
        } else {
            MotorApply(kMotorFL, current.left);
            MotorApply(kMotorRL, current.left);
            MotorApply(kMotorFR, current.right);
            MotorApply(kMotorRR, current.right);
        }

        Heartbeat(TaskId::MOTOR_CONTROL);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.2  GripperTask — 1 servo vía PCA9685
// ---------------------------------------------------------------------------
//  El robot tiene UN SOLO servo de gripper: agarra o suelta. No sube ni baja
//  nada. Los ángulos están calibrados a mano con pruebas-platformio/
//  06-calibracion-gripper/ (ver su README) — el mismo "abierta" sirve para
//  los dos objetos, pero "cerrada" NO: la llave (cubo) y el asta cilíndrica
//  de la bandera tienen grosores distintos, de ahí los dos closed distintos
//  y por qué GripperAction no tiene un CLOSE genérico.

constexpr int kClawOpenDeg          = 0;
constexpr int kClawClosedLlaveDeg   = 120;
constexpr int kClawClosedBanderaDeg = 65;

void GripperTask(void *) {
    // El bus I2C ya fue inicializado en setup(); aquí solo se configura el
    // chip. Todo acceso al PCA9685 comparte el bus 0 con el TCS34725
    // delantero y el VL53L1X: se toma el mutex antes y se suelta al terminar
    // (ver la nota larga junto a g_i2c0Mutex).
    bool pca_ok = false;
    if (I2c0Lock()) {
        pca_ok = Pca9685::Init(Pwm::SERVO_FREQ_HZ);
        if (pca_ok) {
            Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
        }
        I2c0Unlock();
    }
    if (!pca_ok) {
        DEBUG_LINK.println("[Gripper] PCA9685 no responde. Reintentando en segundo plano.");
    }

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::GRIPPER);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

