reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    for (;;) {
        // Si el PCA9685 no arrancó (cable flojo, alimentación ausente), se
        // reintenta cada segundo sin bloquear nada. El robot puede seguir
        // moviéndose y compitiendo mientras tanto.
        if (!pca_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (I2c0Lock()) {
                pca_ok = Pca9685::Init(Pwm::SERVO_FREQ_HZ);
                // Si el PCA9685 no respondió al arrancar (arriba se saltó el
                // SetChannel inicial) y recién ahora reaparece, hay que
                // mandar la pinza a 0° también acá: si no, se queda esperando
                // un GripperCommand que puede tardar en llegar.
                if (pca_ok) {
                    pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
                }
                I2c0Unlock();
            }
        }

        GripperCommand cmd;
        if (xQueueReceive(g_gripperCmdQueue, &cmd, 0) == pdTRUE && pca_ok) {
            // Si el mecanismo se traba, el servo simplemente no llega al
            // ángulo pedido. Esta tarea no se queda esperándolo: manda la
            // orden y sigue, así que un gripper atascado nunca congela a los
            // motores ni al enlace serial.
            if (I2c0Lock()) {
                switch (cmd.action) {
                    case GripperAction::OPEN:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
                        break;
                    case GripperAction::CLOSE_LLAVE:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawClosedLlaveDeg));
                        break;
                    case GripperAction::CLOSE_BANDERA:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawClosedBanderaDeg));
                        break;
                    default:
                        break;
                }
                I2c0Unlock();
            }
        }

        Heartbeat(TaskId::GRIPPER_CONTROL);
        vTaskDelayUntil(&last_wake, period);
    }
}

// Empuja un elemento a una cola FIFO descartando el más viejo si está llena.
// Preferimos telemetría fresca a telemetría completa: un dato de sensor de
// hace medio segundo no le sirve de nada a la Raspberry Pi.
template <typename T>
void PushDropOldest(QueueHandle_t queue, const T &item) {
    if (xQueueSend(queue, &item, 0) != pdTRUE) {
        T discard;
        xQueueReceive(queue, &discard, 0);
        xQueueSend(queue, &item, 0);
    }
}

// ---------------------------------------------------------------------------
//  8.3  TofSensorTask — VL53L1X, telémetro delante del gripper
// ---------------------------------------------------------------------------
//
//  Mide la distancia a lo que tenga delante (la bandera, con suerte) para que
//  la Raspberry Pi sepa CUÁNDO cerrar la pinza — igual que ColorSensorTask y
//  ReflectanceTask, esta tarea solo mide y publica: la decisión de cuándo
//  agarrar vive en la Pi (raspberry-pi/src/athena/decision.py).
//
//  SECUENCIA DE ARRANQUE, y por qué es así:
//  el VL53L1X comparte el bus I2C nº0 con el PCA9685 y el TCS34725 delantero.
//  El PCA9685 no da problema (0x40, distinta), pero el TCS34725 delantero
//  arranca en la MISMA dirección fija 0x29 que el VL53L1X (ver Pins::TOF_XSHUT
//  e I2CAddr::VL53L1X_BOOT_ADDR). La secuencia:
//    1. Mantener XSHUT en LOW un instante: el VL53L1X queda en reset y NO
//       responde en el bus, así que el TCS34725 delantero no tiene con quién
//       chocar mientras tanto.
//    2. Soltar XSHUT (HIGH) y esperar el arranque del sensor.
//    3. Reasignarle una dirección nueva (I2CAddr::VL53L1X) con UNA sola
//       escritura corta — el único instante en que comparte 0x29 con el
//       TCS34725 delantero. Es un riesgo aceptado y documentado (ver la nota
//       larga junto a I2CAddr::VL53L1X_BOOT_ADDR), no un descuido.
//    4. Recién ahora, init() completo: ya en su propia dirección, sin nadie
//       más escuchando en ella.
//
//  Igual que GripperTask con el PCA9685: si el sensor no responde al
//  arranque, se reintenta en segundo plano cada segundo sin bloquear nada.

namespace Tof {
    // El VL53L1X necesita un rato para arrancar tras soltar XSHUT — el
    // datasheet pide ~1.2 ms, se redondea hacia arriba con margen.
    constexpr uint32_t BOOT_DELAY_MS = 2;

    // "Long" alcanza los ~4 m que promete el sensor (a costa de un ciclo de
    // medición más largo); de sobra para esta distancia, que es corta por
    // diseño: el sensor solo tiene que ver la bandera cuando ya está frente
    // al gripper.
    constexpr uint16_t TIMING_BUDGET_US = 50000;   // 50 ms
    constexpr uint32_t RANGING_PERIOD_MS = 50;     // igual a TaskPeriodMs::TOF_SENSOR
}

VL53L1X g_tof;   // única instancia: hay un solo sensor ToF en el robot

bool TofBringUp() {
    g_tof.setBus(&Wire);
    g_tof.setTimeout(500);

    // Ver la nota larga en I2CAddr::VL53L1X_BOOT_ADDR: esta línea es la única
    // transacción que ocurre mientras el VL53L1X sigue en 0x29.
    g_tof.setAddress(I2CAddr::VL53L1X);

    if (!g_tof.init()) return false;

    g_tof.setDistanceMode(VL53L1X::Long);
    g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
    g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
    return true;
}

void TofSensorTask(void *) {
    // El pin ya está en OUTPUT/LOW desde setup() (antes de crear ninguna
    // tarea) — a propósito: algunas placas del VL53L1X traen un pull-up en
    // XSHUT que lo deja activo por defecto, así que si se esperara a este
    // punto para ponerlo en LOW, ColorSensorTask (que corre en paralelo)
    // podría alcanzar a inicializar el TCS34725 delantero mientras el
    // VL53L1X, recién encendido, todavía responde en 0x29 sin que nadie se
    // lo haya pedido. Aquí solo hace falta soltarlo.
    digitalWrite(Pins::TOF_XSHUT, HIGH);    // arranca
    delay(Tof::BOOT_DELAY_MS);

    bool tof_ok = false;
    if (I2c0Lock()) {
        tof_ok = TofBringUp();
        I2c0Unlock();
    }
    if (!tof_ok) {
        DEBUG_LINK.println("[ToF] VL53L1X no responde. Reintentando en segundo plano.");
    }

