reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::TOF_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        // Reintento perezoso, igual que GripperTask/ColorSensorTask: un
        // sensor caído no bloquea nada más. No se repite el cambio de
        // dirección aquí — el VL53L1X la conserva mientras tenga
        // alimentación, así que solo hace falta al arrancar.
        if (!tof_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (I2c0Lock()) {
                tof_ok = g_tof.init();
                if (tof_ok) {
                    g_tof.setDistanceMode(VL53L1X::Long);
                    g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
                    g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
                }
                I2c0Unlock();
            }
        }

        TofReading reading;
        reading.timestamp_ms = millis();

        // dataReady() y read() son las dos transacciones I2C: van juntas
        // bajo el mismo lock, para que nadie se cuele entre "hay dato" y
        // "dame el dato".
        if (tof_ok && I2c0Lock()) {
            if (g_tof.dataReady()) {
                reading.distance_mm = g_tof.read(false);   // no bloqueante: ya sabemos que hay dato
                reading.valid = !g_tof.timeoutOccurred() &&
                                g_tof.ranging_data.range_status == VL53L1X::RangeValid;
                if (g_tof.timeoutOccurred()) tof_ok = false;   // dejó de responder
            }
            I2c0Unlock();
        }

        PushDropOldest(g_tofQueue, reading);

        Heartbeat(TaskId::TOF_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.4  ColorSensorTask — TCS34725 delantero (Wire) y trasero (Wire1)
// ---------------------------------------------------------------------------

void ColorSensorTask(void *) {
    // LED de iluminación de cada sensor, encendido de forma permanente. Es lo
    // más simple y estable, igual que los emisores IR de los QTR: sin él, la
    // clasificación de color dependería de la luz del salón de competencia,
    // que cambia y no se puede controlar. El del TRASERO ya no pasa por un
    // GPIO (ver Pins::TCS_LED_FRONT): queda cableado directo a 3.3V, con el
    // mismo efecto (siempre encendido).
    pinMode(Pins::TCS_LED_FRONT, OUTPUT);
    digitalWrite(Pins::TCS_LED_FRONT, HIGH);

    // El DELANTERO vive en el bus 0, compartido: va bajo mutex. El TRASERO
    // está en Wire1, que no comparte con nadie, así que no lo necesita.
    bool front_ok = false;
    if (I2c0Lock()) {
        front_ok = Tcs34725::Init(Wire);
        I2c0Unlock();
    }
    bool back_ok = Tcs34725::Init(Wire1);

    if (!front_ok) DEBUG_LINK.println("[Color] sensor DELANTERO no responde (bus I2C 0).");
    if (!back_ok)  DEBUG_LINK.println("[Color] sensor TRASERO no responde (bus I2C 1).");

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::COLOR_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        // Reintento perezoso de los sensores caídos, sin bloquear el resto.
        if ((!front_ok || !back_ok) && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (!front_ok && I2c0Lock()) {
                front_ok = Tcs34725::Init(Wire);
                I2c0Unlock();
            }
            if (!back_ok) back_ok = Tcs34725::Init(Wire1);
        }

        ColorReading reading;
        reading.timestamp_ms = millis();

        Tcs34725::Rgbc sample;
        // Se distingue "no se consiguió el bus a tiempo" de "el sensor no
        // respondió". Lo primero es normal bajo contención y NO debe marcar
        // el sensor como caído: simplemente no hay lectura esta vuelta. Solo
        // un Read() que falla de verdad lo manda a reintento.
        bool front_read = false;
        bool front_intentado = false;
        if (front_ok && I2c0Lock()) {
            front_intentado = true;
            front_read = Tcs34725::Read(Wire, sample);
            I2c0Unlock();
        }
        if (front_read) {
            reading.front = ClassifyColor(sample);
            reading.front_valid = true;
        } else if (front_intentado) {
            front_ok = false;                 // se marcará para reintento
        }

        if (back_ok && Tcs34725::Read(Wire1, sample)) {
            reading.back = ClassifyColor(sample);
            reading.back_valid = true;
        } else {
            back_ok = false;
        }

        PushDropOldest(g_colorQueue, reading);

        Heartbeat(TaskId::COLOR_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.5  ReflectanceTask — 2x QTRX-HD-01A
// ---------------------------------------------------------------------------
//
//  CÓMO SE LEE ESTE SENSOR (importante, porque es contraintuitivo):
//  el QTR entrega un voltaje INVERSAMENTE proporcional a la reflectancia.
//  Superficie clara -> mucha luz IR rebotada -> el fototransistor conduce ->
//  la salida cae cerca de 0 V. Superficie oscura -> poca luz rebotada ->
//  la salida sube cerca de VIN.
//
//  O sea: valor ADC ALTO = superficie OSCURA (cinta negra).
//
//  ¡ALIMENTAR EL QTRX A 3.3 V! Su salida es proporcional a su VIN: alimentado
//  a 5 V entregaría hasta 5 V en un pin de ADC que solo tolera 3.3 V.

// TODO: calibrar sobre la pista real, con la luz del salón de competencia.
// El script raspberry-pi/scripts/ ayuda a leer los valores en vivo.
constexpr uint16_t kDarkThreshold = 2048;   // ADC de 12 bits -> rango 0..4095

void ReflectanceTask(void *) {
    analogReadResolution(12);

    // Atenuación de 11 dB: extiende el rango útil del ADC a ~0..3.1 V, que es
    // lo que necesitamos para leer la excursión completa del QTR a 3.3 V.
    analogSetPinAttenuation(Pins::QTR_LEFT_OUT, ADC_11db);
    analogSetPinAttenuation(Pins::QTR_RIGHT_OUT, ADC_11db);

