reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    // Emisores IR encendidos de forma permanente. Es lo más simple y estable;
    // si más adelante hace falta compensar la luz ambiente, se apagan aquí,
    // se toma una lectura, se encienden y se resta.
    pinMode(Pins::QTR_EMITTER_CTRL, OUTPUT);
    digitalWrite(Pins::QTR_EMITTER_CTRL, HIGH);

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::REFLECTANCE);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        ReflectanceReading reading;
        reading.timestamp_ms  = millis();
        reading.left_raw      = (uint16_t)analogRead(Pins::QTR_LEFT_OUT);
        reading.right_raw     = (uint16_t)analogRead(Pins::QTR_RIGHT_OUT);
        reading.left_on_line  = reading.left_raw  > kDarkThreshold;
        reading.right_on_line = reading.right_raw > kDarkThreshold;

        PushDropOldest(g_reflectQueue, reading);

        Heartbeat(TaskId::REFLECTANCE);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.6  LedTask — LED RGB indicador de equipo (lo exige el reglamento)
// ---------------------------------------------------------------------------
//  Hasta hace poco esto eran 2 LED discretos (rojo/azul) con digitalWrite.
//  El equipo los reemplazó por un único LED RGB (validado primero en
//  pruebas-platformio/02-cuadro-color-rgb/), así que ahora se maneja por PWM.
//  Queda con margen para lo que haga falta más adelante: cualquier otra señal
//  visual se resuelve mezclando los 3 canales, sin cablear nada nuevo.

namespace RgbLed {
    // Canales LEDC 4..6: los motores ya ocupan 0..3 (ver 8.1).
    constexpr uint8_t CH_R = 4;
    constexpr uint8_t CH_G = 5;
    constexpr uint8_t CH_B = 6;

    // POLARIDAD CONFIRMADA con el LED físico: es CÁTODO COMÚN, o sea duty
    // alto = canal más brillante, que es el sentido natural del código. La
    // constante se conserva porque documenta esa decisión y deja la vuelta
    // preparada si algún día se cambia el LED por uno de ánodo común.
    constexpr bool kCommonAnode = false;

    void Setup() {
        PwmAttach(Pins::LED_RGB_R, CH_R, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_G, CH_G, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_B, CH_B, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
    }

    void SetRaw(uint8_t r, uint8_t g, uint8_t b) {
        if (kCommonAnode) { r = 255 - r; g = 255 - g; b = 255 - b; }
        PwmWrite(Pins::LED_RGB_R, CH_R, r);
        PwmWrite(Pins::LED_RGB_G, CH_G, g);
        PwmWrite(Pins::LED_RGB_B, CH_B, b);
    }

    void ApplyTeam(TeamColor team) {
        switch (team) {
            case TeamColor::RED:  SetRaw(255, 0, 0); break;
            case TeamColor::BLUE: SetRaw(0, 0, 255); break;
            case TeamColor::NONE:
            default:              SetRaw(0, 0, 0);   break;
        }
    }
}

// ---------------------------------------------------------------------------
//  Switch de 3 posiciones (ON-OFF-ON): quién es "nuestro equipo" al arrancar.
// ---------------------------------------------------------------------------
//  Ver Pins::TEAM_SWITCH_BLUE / TEAM_SWITCH_RED y hardware/conexiones-esp32-
//  s3.md. Se lee en cada vuelta de LedTask (250 ms) en vez de una sola vez en
//  setup(): así, si alguien mueve el switch después de energizar el robot
//  (el procedimiento normal: encender con el switch en 0 y recién ahí elegir
//  equipo), el cambio se recoge sin tener que reiniciar el ESP32.
namespace TeamSwitch {
    void Setup() {
        pinMode(Pins::TEAM_SWITCH_BLUE, INPUT_PULLUP);
        pinMode(Pins::TEAM_SWITCH_RED,  INPUT_PULLUP);
    }

    // LOW = tiro cerrado a GND = esa posición está seleccionada. Si algún día
    // el switch fallara y los 2 tiros leyeran cerrados a la vez (no debería
    // pasar con un ON-OFF-ON sano), se trata igual que la posición central:
    // más seguro reportar "nadie ha elegido" que adivinar un color.
    TeamColor Read() {
        const bool blue_closed = digitalRead(Pins::TEAM_SWITCH_BLUE) == LOW;
        const bool red_closed  = digitalRead(Pins::TEAM_SWITCH_RED)  == LOW;
        if (blue_closed && !red_closed) return TeamColor::BLUE;
        if (red_closed  && !blue_closed) return TeamColor::RED;
        return TeamColor::NONE;
    }
}

// Cuántas vueltas de LedTask dura cada mitad del destello (encendido/apagado)
// cuando se está señalizando la bandera contraria. A TaskPeriodMs::LED_STATUS
// (250 ms) esto da un destello de ~2 Hz: rápido de notar a simple vista desde
// la mesa de jueces, sin parpadear tan rápido que parezca un LED fundido.
constexpr uint32_t kFlagBlinkHalfPeriodTicks = 1;

void LedTask(void *) {
    RgbLed::Setup();
    RgbLed::SetRaw(0, 0, 0);
    TeamSwitch::Setup();

    TeamColor commanded_team = TeamColor::NONE;   // último CMD_LED recibido
    bool flag_detected = false;
    uint32_t blink_tick = 0;

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::LED_STATUS);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        LedCommand cmd;
        if (xQueueReceive(g_ledCmdQueue, &cmd, 0) == pdTRUE) commanded_team = cmd.team;

        // El switch físico es la fuente de verdad: si alguien lo movió de la
        // posición central, manda sobre lo que haya dicho la Raspberry Pi por
        // CMD_LED. Si sigue en el centro (NONE, el reposo normal al
        // encender), se respeta el último CMD_LED — así el LED sigue
        // funcionando en banco sin el switch instalado (por ejemplo en
        // pruebas-platformio/02-cuadro-color-rgb/).
        const TeamColor switch_team = TeamSwitch::Read();
        g_switchTeam = switch_team;   // MotorTask la lee para no moverse en NONE

        TeamSwitchReading switch_reading;
        switch_reading.timestamp_ms = millis();
        switch_reading.team = switch_team;
        xQueueOverwrite(g_teamSwitchQueue, &switch_reading);

        const TeamColor team = (switch_team != TeamColor::NONE) ? switch_team : commanded_team;

