reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
        // Cola "overwrite": solo importa si la cámara ve la bandera AHORA, no
        // un fotograma viejo. Si la Raspberry Pi deja de mandar esta señal
        // (se cae el enlace, por ejemplo), el LED simplemente vuelve a quedar
        // en el color de equipo fijo — no hay estado "pegado" en destello.
        FlagSignalCommand flag_cmd;
        if (xQueueReceive(g_flagSignalCmdQueue, &flag_cmd, 0) == pdTRUE) {
            flag_detected = flag_cmd.detected;
        }

        if (flag_detected) {
            // Alterna entre BLANCO (destello) y el color de equipo: sigue
            // identificando al equipo ante los jueces mientras además avisa
            // que ve la bandera contraria — ninguna señal tapa a la otra.
            blink_tick = (blink_tick + 1) % (2 * kFlagBlinkHalfPeriodTicks);
            if (blink_tick < kFlagBlinkHalfPeriodTicks) {
                RgbLed::SetRaw(255, 255, 255);
            } else {
                RgbLed::ApplyTeam(team);
            }
        } else {
            blink_tick = 0;
            RgbLed::ApplyTeam(team);
        }

        Heartbeat(TaskId::LED_STATUS);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.7  SerialTask — único punto de contacto con la Raspberry Pi
// ---------------------------------------------------------------------------
//  Es la ÚNICA tarea que toca el enlace con la RPi. Ninguna otra escribe en
//  él, así que no hace falta un mutex para el puerto.
//
//  El receptor es una máquina de estados que consume byte a byte. Nunca
//  bloquea esperando el resto de una trama: si el paquete llega partido en
//  varios pedazos (cosa normal), simplemente retoma donde quedó en la vuelta
//  siguiente. Cualquier byte suelto o checksum malo lo devuelve a WAIT_START,
//  de modo que una trama corrupta no puede trabar el enlace.

enum class RxState : uint8_t { WAIT_START, READ_TYPE, READ_LEN, READ_PAYLOAD, READ_CHECKSUM };

void SerialSendPacket(uint8_t type, const uint8_t *payload, uint8_t len) {
    if (len > Proto::MAX_PAYLOAD) return;

    // 4 bytes de sobrecarga: START, TYPE, LEN y CHECKSUM.
    uint8_t buf[4 + Proto::MAX_PAYLOAD];
    buf[0] = Proto::START_BYTE;
    buf[1] = type;
    buf[2] = len;
    memcpy(&buf[3], payload, len);
    buf[3 + len] = Proto::Checksum(type, len, payload);
    RPI_LINK.write(buf, (size_t)(4 + len));
}

// Despacha un paquete ya validado hacia la cola que le toca.
void SerialDispatch(uint8_t type, const uint8_t *payload, uint8_t len) {
    switch (type) {
        case Proto::CMD_MOTOR: {
            if (len != Proto::LEN_CMD_MOTOR) return;
            MotorCommand cmd;
            cmd.mode  = (payload[0] == 1) ? MotorMode::DRIVE : MotorMode::STOP;
            cmd.left  = (int8_t)payload[1];
            cmd.right = (int8_t)payload[2];
            xQueueOverwrite(g_motorCmdQueue, &cmd);
            break;
        }
        case Proto::CMD_GRIPPER: {
            if (len != Proto::LEN_CMD_GRIPPER) return;
            if (payload[0] > (uint8_t)GripperAction::CLOSE_BANDERA) return;
            GripperCommand cmd;
            cmd.action = (GripperAction)payload[0];
            xQueueSend(g_gripperCmdQueue, &cmd, 0);
            break;
        }
        case Proto::CMD_LED: {
            if (len != Proto::LEN_CMD_LED) return;
            if (payload[0] > (uint8_t)TeamColor::BLUE) return;
            LedCommand cmd;
            cmd.team = (TeamColor)payload[0];
            xQueueOverwrite(g_ledCmdQueue, &cmd);
            break;
        }
        case Proto::CMD_FLAG_SIGNAL: {
            if (len != Proto::LEN_CMD_FLAG_SIGNAL) return;
            FlagSignalCommand cmd;
            cmd.detected = (payload[0] != 0);
            xQueueOverwrite(g_flagSignalCmdQueue, &cmd);
            break;
        }
        default:
            break;   // tipo desconocido: se ignora, el enlace sigue vivo
    }
}

void SerialTask(void *) {
    RxState state = RxState::WAIT_START;
    uint8_t rx_type = 0, rx_len = 0, rx_index = 0;
    uint8_t rx_payload[Proto::MAX_PAYLOAD];

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::SERIAL_COMM);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        // --- Recepción: consume lo que haya llegado, sin bloquear nunca ---
        // El tope por vuelta evita que una ráfaga de basura acapare la CPU.
        int budget = 256;
        while (RPI_LINK.available() > 0 && budget-- > 0) {
            const uint8_t b = (uint8_t)RPI_LINK.read();
            switch (state) {
                case RxState::WAIT_START:
                    if (b == Proto::START_BYTE) state = RxState::READ_TYPE;
                    break;

                case RxState::READ_TYPE:
                    if (Proto::IsReceivableType(b)) {
                        rx_type = b;
                        state = RxState::READ_LEN;
                    } else if (b != Proto::START_BYTE) {
                        state = RxState::WAIT_START;
                    }
                    // Si b ES el byte de inicio, nos quedamos en READ_TYPE:
                    // era un 0xAA de relleno y el tipo real viene ahora.
                    break;

                case RxState::READ_LEN:
                    rx_len = b;
                    if (rx_len > Proto::MAX_PAYLOAD) {
                        state = RxState::WAIT_START;   // largo imposible: resincronizar
                    } else {
                        rx_index = 0;
                        state = (rx_len == 0) ? RxState::READ_CHECKSUM : RxState::READ_PAYLOAD;
                    }
                    break;

                case RxState::READ_PAYLOAD:
                    rx_payload[rx_index++] = b;
                    if (rx_index >= rx_len) state = RxState::READ_CHECKSUM;
                    break;

                case RxState::READ_CHECKSUM:
                    if (b == Proto::Checksum(rx_type, rx_len, rx_payload)) {
                        SerialDispatch(rx_type, rx_payload, rx_len);
                    }
                    // Calce o no el checksum, siempre volvemos al inicio.
                    state = RxState::WAIT_START;
                    break;
            }
        }

        // --- Envío de telemetría ---
        uint8_t payload[Proto::MAX_PAYLOAD];

        ColorReading color;
        while (xQueueReceive(g_colorQueue, &color, 0) == pdTRUE) {
            Proto::WriteU32LE(&payload[0], color.timestamp_ms);
            payload[4] = (uint8_t)color.front;
            payload[5] = (uint8_t)color.back;
            payload[6] = (uint8_t)((color.front_valid ? 0x01 : 0) |
                                   (color.back_valid  ? 0x02 : 0));
            SerialSendPacket(Proto::TLM_COLOR, payload, Proto::LEN_TLM_COLOR);
        }

