reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
        ReflectanceReading reflect;
        while (xQueueReceive(g_reflectQueue, &reflect, 0) == pdTRUE) {
            Proto::WriteU32LE(&payload[0], reflect.timestamp_ms);
            Proto::WriteU16LE(&payload[4], reflect.left_raw);
            Proto::WriteU16LE(&payload[6], reflect.right_raw);
            payload[8] = (uint8_t)((reflect.left_on_line  ? 0x01 : 0) |
                                   (reflect.right_on_line ? 0x02 : 0));
            SerialSendPacket(Proto::TLM_REFLECT, payload, Proto::LEN_TLM_REFLECT);
        }

        TofReading tof;
        while (xQueueReceive(g_tofQueue, &tof, 0) == pdTRUE) {
            Proto::WriteU32LE(&payload[0], tof.timestamp_ms);
            Proto::WriteU16LE(&payload[4], tof.distance_mm);
            payload[6] = (uint8_t)(tof.valid ? 0x01 : 0);
            SerialSendPacket(Proto::TLM_TOF, payload, Proto::LEN_TLM_TOF);
        }

        HealthReport health;
        while (xQueueReceive(g_healthQueue, &health, 0) == pdTRUE) {
            Proto::WriteU32LE(&payload[0], health.timestamp_ms);
            payload[4] = health.faulted_tasks_bitmask;
            SerialSendPacket(Proto::TLM_HEALTH, payload, Proto::LEN_TLM_HEALTH);
        }

        TeamSwitchReading switch_reading;
        while (xQueueReceive(g_teamSwitchQueue, &switch_reading, 0) == pdTRUE) {
            Proto::WriteU32LE(&payload[0], switch_reading.timestamp_ms);
            payload[4] = (uint8_t)switch_reading.team;
            SerialSendPacket(Proto::TLM_TEAM_SWITCH, payload, Proto::LEN_TLM_TEAM_SWITCH);
        }

        Heartbeat(TaskId::SERIAL_COMM);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.8  SupervisorTask — vigila que las demás tareas sigan vivas
// ---------------------------------------------------------------------------
//
//  ESTRATEGIA DE TOLERANCIA A FALLOS
//
//  1. Cada tarea es dueña de su propio hardware y su propia cola. Un fallo al
//     leer el TCS34725 no puede bloquear la cola de los motores.
//  2. Ninguna tarea bloquea indefinidamente. Todo lleva timeout.
//  3. Los drivers I2C devuelven bool y las tareas reintentan en segundo plano
//     en vez de quedarse esperando a un chip que no contesta.
//  4. MotorTask tiene su propio failsafe si se cae el enlace con la RPi.
//  5. Cada tarea marca un heartbeat; esta tarea detecta a la que dejó de
//     marcar (colgada en un I2C que no responde, un bucle sin salida, etc.).
//
//  Cuando detecta una tarea colgada NO reinicia el ESP32: registra el fallo y
//  se lo reporta a la Raspberry Pi, que es donde vive la lógica de decisión.
//  Así la RPi puede, por ejemplo, dejar de confiar en el sensor de color y
//  seguir compitiendo, mientras el resto de tareas siguen normales.
//
//  LÍMITE CONOCIDO, dicho sin adornos: el ESP32-S3 no tiene MMU, así que todas
//  las tareas comparten el mismo espacio de memoria. Este diseño aísla tareas
//  COLGADAS, no memoria corrupta: un desbordamiento de stack severo en una
//  tarea sí puede dañar a otra. Por eso hay que medir los stacks reales con
//  uxTaskGetStackHighWaterMark() durante las pruebas, y por eso ninguna tarea
//  reserva memoria dinámica dentro de su bucle.

void SupervisorTask(void *) {
    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::SUPERVISOR);
    TickType_t last_wake = xTaskGetTickCount();

    uint8_t previous_faults = 0;

    for (;;) {
        const uint8_t faulted = WatchdogCheck();

        // Se manda cada vuelta, con el bitmask en 0 cuando todo está sano:
        // así el silencio total en TLM_HEALTH es una señal real de que el
        // ESP32 dejó de hablar (o el propio SupervisorTask se colgó), no un
        // caso ambiguo con "todo va bien".
        HealthReport report;
        report.timestamp_ms = millis();
        report.faulted_tasks_bitmask = faulted;
        xQueueOverwrite(g_healthQueue, &report);

        // Se registra por consola solo cuando el conjunto de fallos CAMBIA,
        // para no inundar el log con la misma línea 5 veces por segundo.
        if (faulted != previous_faults) {
            DEBUG_LINK.printf("[Supervisor] tareas colgadas: 0x%02X\n", faulted);
            previous_faults = faulted;
        }

        vTaskDelayUntil(&last_wake, period);
    }
}

} // namespace anónimo

// ===========================================================================
//  [9] setup() / loop()
// ===========================================================================

static bool CreateQueues() {
    g_motorCmdQueue      = xQueueCreate(1, sizeof(MotorCommand));
    g_gripperCmdQueue    = xQueueCreate(4, sizeof(GripperCommand));
    g_ledCmdQueue        = xQueueCreate(1, sizeof(LedCommand));
    g_flagSignalCmdQueue = xQueueCreate(1, sizeof(FlagSignalCommand));
    g_colorQueue         = xQueueCreate(4, sizeof(ColorReading));
    g_reflectQueue       = xQueueCreate(4, sizeof(ReflectanceReading));
    g_tofQueue           = xQueueCreate(4, sizeof(TofReading));
    g_healthQueue        = xQueueCreate(1, sizeof(HealthReport));
    g_teamSwitchQueue    = xQueueCreate(1, sizeof(TeamSwitchReading));

    return g_motorCmdQueue && g_gripperCmdQueue && g_ledCmdQueue && g_flagSignalCmdQueue &&
           g_colorQueue && g_reflectQueue && g_tofQueue && g_healthQueue && g_teamSwitchQueue;
}

// Por qué se reinició el ESP32 la última vez. Distinguir un BROWNOUT (batería
// o alimentación floja) de un PANIC (bug del firmware) o de un simple POWERON
// ahorra horas de depuración a ciegas: los síntomas en la pista son los
// mismos —el robot "se queda"— pero la causa y el arreglo no tienen nada que
// ver. Se diagnosticó primero en firmware-esp32-standalone/ (commit 2db53fb).
static const char *ResetReasonToString(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_POWERON:   return "POWERON (se energizo desde cero)";
        case ESP_RST_EXT:       return "EXTERNO (pin de reset)";
        case ESP_RST_SW:        return "SOFTWARE (esp_restart() o similar)";
        case ESP_RST_PANIC:     return "PANIC (excepcion/crash del firmware)";
        case ESP_RST_INT_WDT:   return "INTERRUPT WATCHDOG";
        case ESP_RST_TASK_WDT:  return "TASK WATCHDOG (una tarea no volvio a tiempo)";
        case ESP_RST_WDT:       return "OTRO WATCHDOG";
        case ESP_RST_DEEPSLEEP: return "DEEP SLEEP";
        case ESP_RST_BROWNOUT:  return "BROWNOUT: el voltaje cayo debajo del minimo -- revisar bateria/alimentacion";
        case ESP_RST_SDIO:      return "SDIO";
        default:                return "DESCONOCIDO";
    }
}

void setup() {
    DEBUG_LINK.begin(SERIAL_BAUD_RATE);   // consola por el puerto UART del DevKit
    RPI_LINK.begin(SERIAL_BAUD_RATE);     // enlace USB con la Raspberry Pi
    delay(200);
    DEBUG_LINK.println("\nAthena Rover 2026 - firmware ESP32-S3");
    DEBUG_LINK.printf("[Setup] Motivo del ultimo reinicio: %s\n",
                       ResetReasonToString(esp_reset_reason()));

    // Los dos buses I2C se abren aquí, ANTES de lanzar las tareas, para que
    // ninguna tarea tenga que inicializar hardware compartido.
    Wire.begin(Pins::I2C0_SDA, Pins::I2C0_SCL, 400000);   // PCA9685 + TCS34725 delantero + VL53L1X
    Wire1.begin(Pins::I2C1_SDA, Pins::I2C1_SCL, 400000);  // TCS34725 trasero

    // Timeout corto: si un chip I2C se cuelga tirando SDA a masa, la
    // transacción falla rápido en vez de congelar la tarea que la pidió.
    Wire.setTimeOut(25);
    Wire1.setTimeOut(25);

